LEXICON_RU: dict[str, str] = {
    '/start': 'Привет!\n\nЯ бот для ваших тренировок.\n\nЯ помогу вам оптимизировать ваше занятие спортом: \n1) Cделать его более осознанным.\n2) Визуализировать ваш прогресс для большей мотивации заниматься дальше спортом.',
    'no_echo': 'Данный тип апдейтов не поддерживается '
               'методом send_copy',
    'choice_day': 'Выберите день недели',
    'choice_workout': 'Напишите упражнение и через пробел количество подходов, пример: "отжумание 5"',
    'choice_level': 'Выберите уровень упражнения',
    'additional_workout': 'Хотите ли вы добавить новое упражнение в ',
    'additional_day': 'Хотите ли вы добавить дополнительный день?',
    'successfully': 'Все успешно сохранено!',
    'save_data': 'Сохранить веденные данные или отчистить?',
    'notion': 'Хотите сделать напоминание?',
    'when_notion': "Когда напоминать вам? (пример ввода: 12:30)",
    'notion_is_created': 'Напоминание успешно создано!',
    'notion_training': 'Пора тренироваться, кусок сала!!!\n'
                      'Хотите начать тренировку?',
    'train': 'Введите количество повторений в',
    'not_day_of_training': 'такого дня нет, возможно вы пропустили день тренировки',
    'choice_day_of_training': 'В какой день тренировочной программы вы бы хотели тренироваться?',
}

LEXICON_KB: dict[str, str] = {
    'button_pressed_cardio': 'кардио-тренировка',
    'button_pressed_weight': 'тренировка на массу',
    'button_pressed_strength': 'тренировка на силу',
}
WEEKDAYS = ["mon", "tue", "wed", "thu", "fri", "sat", "sun"]

LEXICON_INL_KB: dict[str, str] = {
    'button_pressed_mon': 'Понедельник',
    'button_pressed_tue': 'Вторник',
    'button_pressed_wed': 'Среда',
    'button_pressed_thu': 'Четверг',
    'button_pressed_fri': 'Пятница',
    'button_pressed_sat': 'Суббота',
    'button_pressed_sun': 'Воскресенье',
    'continue': 'далее'
}

TRANSLATION: dict[str, str] = {
    'mon': 'понедельник',
    'tue': 'вторник',
    'wed': 'среда',
    'thu': 'четверг',
    'fri': 'пятница',
    'sat': 'суббота',
    'sun': 'воскресенье'
}

